; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-90)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc9)
    (at car1 loc4)
    (at car2 loc4)
    (at car3 loc11)
    (at car4 loc12)
    (at car5 loc10)
    (at car6 loc11)
    (at car7 loc8)
    (at car8 loc2)
    (at car9 loc6)
    (at car10 loc13)
    (at car11 loc4)
    (at car12 loc4)
    (at car13 loc14)
    (at car14 loc5)
    (at car15 loc12)
    (at car16 loc6)
    (at car17 loc6)
    (at car18 loc12)
)
 (:goal (and 
(at car1 loc3)
(at car2 loc2)
(at car3 loc13)
(at car4 loc11)
(at car5 loc6)
(at car6 loc5)
))
)

; plan
1. (sail loc9 loc10)
   deleted: (at-ferry loc9)
   added: (at-ferry loc10)
   goals met: 0 of 6
2. (board car5 loc10)
   deleted: (at car5 loc10) (empty-ferry)
   added: (on car5)
   goals met: 0 of 6
3. (sail loc10 loc6)
   deleted: (at-ferry loc10)
   added: (at-ferry loc6)
   goals met: 0 of 6
4. (debark car5 loc6)
   deleted: (on car5)
   added: (at car5 loc6) (empty-ferry)
   goals met: 1 of 6
5. (sail loc6 loc12)
   deleted: (at-ferry loc6)
   added: (at-ferry loc12)
   goals met: 1 of 6
6. (board car4 loc12)
   deleted: (at car4 loc12) (empty-ferry)
   added: (on car4)
   goals met: 1 of 6
7. (sail loc12 loc11)
   deleted: (at-ferry loc12)
   added: (at-ferry loc11)
   goals met: 1 of 6
8. (debark car4 loc11)
   deleted: (on car4)
   added: (at car4 loc11) (empty-ferry)
   goals met: 2 of 6
9. (board car3 loc11)
   deleted: (at car3 loc11) (empty-ferry)
   added: (on car3)
   goals met: 2 of 6
10. (sail loc11 loc13)
   deleted: (at-ferry loc11)
   added: (at-ferry loc13)
   goals met: 2 of 6
11. (debark car3 loc13)
   deleted: (on car3)
   added: (at car3 loc13) (empty-ferry)
   goals met: 3 of 6
12. (sail loc13 loc4)
   deleted: (at-ferry loc13)
   added: (at-ferry loc4)
   goals met: 3 of 6
13. (board car2 loc4)
   deleted: (at car2 loc4) (empty-ferry)
   added: (on car2)
   goals met: 3 of 6
14. (sail loc4 loc2)
   deleted: (at-ferry loc4)
   added: (at-ferry loc2)
   goals met: 3 of 6
15. (debark car2 loc2)
   deleted: (on car2)
   added: (at car2 loc2) (empty-ferry)
   goals met: 4 of 6
16. (sail loc2 loc11)
   deleted: (at-ferry loc2)
   added: (at-ferry loc11)
   goals met: 4 of 6
17. (board car6 loc11)
   deleted: (at car6 loc11) (empty-ferry)
   added: (on car6)
   goals met: 4 of 6
18. (sail loc11 loc5)
   deleted: (at-ferry loc11)
   added: (at-ferry loc5)
   goals met: 4 of 6
19. (debark car6 loc5)
   deleted: (on car6)
   added: (at car6 loc5) (empty-ferry)
   goals met: 5 of 6
20. (sail loc5 loc4)
   deleted: (at-ferry loc5)
   added: (at-ferry loc4)
   goals met: 5 of 6
21. (board car1 loc4)
   deleted: (at car1 loc4) (empty-ferry)
   added: (on car1)
   goals met: 5 of 6
22. (sail loc4 loc3)
   deleted: (at-ferry loc4)
   added: (at-ferry loc3)
   goals met: 5 of 6
23. (debark car1 loc3)
   deleted: (on car1)
   added: (at car1 loc3) (empty-ferry)
   goals met: 6 of 6
